//dropDown数据
let dropDownData = {
    myJD: [{
        title: '',
        items: [{
            href: '#',
            name: '待处理订单'
        }, {
            href: '#',
            name: '返修退换货',
        }, {
            href: '#',
            name: '降价商品'
        }, {
            href: '#',
            name: '消息'
        }, {
            href: '#',
            name: '我的问答'
        }, {
            href: '#',
            name: '我的关注'
        }]
    }, {
        title: '',
        // col: 2,
        items: [{
            href: '#',
            name: '我的京豆'
        }, {
            href: '#',
            name: '我的优惠券'
        }, {
            href: '#',
            name: '我的白条'
        }, {
            href: '#',
            name: '我的理财'
        }]
    },
    ],
    company: [{
        title: '',
        items: [{
            href: '#',
            name: '企业购'
        }, {
            href: '#',
            name: '商用场景观',
        }, {
            href: '#',
            name: '工业品'
        }, {
            href: '#',
            name: '礼品卡'
        }]
    }],
    service: [{
        title: '客户',
        items: [{
            href: '#',
            name: '帮助中心'
        }, {
            href: '#',
            name: '售后服务',
        }, {
            href: '#',
            name: '在线客服'
        }, {
            href: '#',
            name: '意见建议'
        }, {
            href: '#',
            name: '电话客服'
        }, {
            href: '#',
            name: '客服邮箱'
        }, {
            href: '#',
            name: '金融咨询'
        }, {
            href: '#',
            name: '全球售客服'
        }]
    }, {
        title: '商户',
        items: [{
            href: '#',
            name: '帮助中心'
        }, {
            href: '#',
            name: '售后服务',
        }, {
            href: '#',
            name: '在线客服'
        }, {
            href: '#',
            name: '意见建议'
        }, {
            href: '#',
            name: '电话客服'
        }, {
            href: '#',
            name: '客服邮箱'
        }, {
            href: '#',
            name: '金融咨询'
        }, {
            href: '#',
            name: '全球售客服'
        }]
    }],
    app: [{
        title: '特色主题',
        // col: 4,
        width: 340,
        items: [{
            href: '#',
            name: '帮助中心'
        }, {
            href: '#',
            name: '售后服务',
        }, {
            href: '#',
            name: '在线客服'
        }, {
            href: '#',
            name: '意见建议'
        }, {
            href: '#',
            name: '电话客服'
        }, {
            href: '#',
            name: '客服邮箱'
        }, {
            href: '#',
            name: '金融咨询'
        }, {
            href: '#',
            name: '全球售客服'
        }, {
            href: '#',
            name: '帮助中心'
        }, {
            href: '#',
            name: '售后服务',
        }, {
            href: '#',
            name: '在线客服'
        }, {
            href: '#',
            name: '意见建议'
        }, {
            href: '#',
            name: '电话客服'
        }, {
            href: '#',
            name: '客服邮箱'
        }, {
            href: '#',
            name: '金融咨询'
        }, {
            href: '#',
            name: '全球售客服'
        }, {
            href: '#',
            name: '客服邮箱'
        }, {
            href: '#',
            name: '金融咨询'
        }, {
            href: '#',
            name: '全球售客服'
        }]
    }, {
        title: '商户',
        // col: 3,
        width: 255,
        items: [{
            href: '#',
            name: '帮助中心'
        }, {
            href: '#',
            name: '售后服务',
        }, {
            href: '#',
            name: '在线客服'
        }, {
            href: '#',
            name: '意见建议'
        }, {
            href: '#',
            name: '电话客服'
        }, {
            href: '#',
            name: '客服邮箱'
        }, {
            href: '#',
            name: '金融咨询'
        }, {
            href: '#',
            name: '全球售客服'
        }]
    }]
};
//左侧菜单栏数据
let menuList = [{
    title: ['家用电器'],
    content: {
        tabs: ['家电馆', '镇乡专卖店', '家电服务'],
        subs: [{
            title: '电视',
            items: ["曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件", "曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件", "曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        }, {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新"]
        }]
    }
}, {
    title: ['手机', '运营商', '数码'],
    content: {
        tabs: ['手机'],
        subs: [{
            title: '手机',
            items: ["曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        }, {
            title: '手表',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新"]
        }]
    }
}, {
    title: ['电脑', '办公'],
    content: {
        tabs: ['家电馆', '镇乡专卖店', '家电服务'],
        subs: [{
            title: '电视',
            items: ["曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        }, {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新", "壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新", "壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新"]
        }]
    }
}, {
    title: ['家用电器'],
    content: {
        tabs: ['家电馆', '镇乡专卖店', '家电服务'],
        subs: [{
            title: '电视',
            items: ["曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件", "曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件", "曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        }, {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新"]
        }]
    }
}, {
    title: ['手机', '运营商', '数码'],
    content: {
        tabs: ['手机'],
        subs: [{
            title: '手机',
            items: ["曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        }, {
            title: '手表',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新"]
        }]
    }
}, {
    title: ['电脑', '办公'],
    content: {
        tabs: ['家电馆', '镇乡专卖店', '家电服务'],
        subs: [{
            title: '电视',
            items: ["曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        }, {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新", "壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新", "壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新"]
        }]
    }
}, {
    title: ['家用电器'],
    content: {
        tabs: ['家电馆', '镇乡专卖店', '家电服务'],
        subs: [{
            title: '电视',
            items: ["曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件", "曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件", "曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        }, {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新"]
        }]
    }
}, {
    title: ['手机', '运营商', '数码'],
    content: {
        tabs: ['手机'],
        subs: [{
            title: '手机',
            items: ["曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        }, {
            title: '手表',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新"]
        }]
    }
}, {
    title: ['电脑', '办公'],
    content: {
        tabs: ['家电馆', '镇乡专卖店', '家电服务'],
        subs: [{
            title: '电视',
            items: ["曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        }, {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新", "壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新", "壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新"]
        }]
    }
}, {
    title: ['家用电器'],
    content: {
        tabs: ['家电馆', '镇乡专卖店', '家电服务'],
        subs: [{
            title: '电视',
            items: ["曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件", "曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件", "曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        }, {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新"]
        }]
    }
}, {
    title: ['手机', '运营商', '数码'],
    content: {
        tabs: ['手机'],
        subs: [{
            title: '手机',
            items: ["曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        }, {
            title: '手表',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新"]
        }]
    }
}, {
    title: ['电脑', '办公'],
    content: {
        tabs: ['家电馆', '镇乡专卖店', '家电服务'],
        subs: [{
            title: '电视',
            items: ["曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        }, {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新", "壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新", "壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新"]
        }]
    }
}, {
    title: ['家用电器'],
    content: {
        tabs: ['家电馆', '镇乡专卖店', '家电服务'],
        subs: [{
            title: '电视',
            items: ["曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件", "曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件", "曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        }, {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新"]
        }]
    }
}, {
    title: ['手机', '运营商', '数码'],
    content: {
        tabs: ['手机'],
        subs: [{
            title: '手机',
            items: ["曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        }, {
            title: '手表',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新"]
        }]
    }
}, {
    title: ['电脑', '办公'],
    content: {
        tabs: ['家电馆', '镇乡专卖店', '家电服务'],
        subs: [{
            title: '电视',
            items: ["曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        }, {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新", "壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新", "壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新"]
        }]
    }
}, {
    title: ['家用电器'],
    content: {
        tabs: ['家电馆', '镇乡专卖店', '家电服务'],
        subs: [{
            title: '电视',
            items: ["曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件", "曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件", "曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        }, {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新"]
        }]
    }
}, {
    title: ['手机', '运营商', '数码'],
    content: {
        tabs: ['手机'],
        subs: [{
            title: '手机',
            items: ["曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        }, {
            title: '手表',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新"]
        }]
    }
}, {
    title: ['电脑', '办公'],
    content: {
        tabs: ['家电馆', '镇乡专卖店', '家电服务'],
        subs: [{
            title: '电视',
            items: ["曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        }, {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新", "壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新", "壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新"]
        }]
    }
}];

//热搜关键词数据
let hotwordsData = ['大牌直播周', '手机五折抢', '母婴好物萃'];
let placeholderData = ['香奈儿香水', '欧普照明', '投影仪', '牛奶'];

// 跑马灯数据
let swiper1Data = [
    'https://img12.360buyimg.com/babel/s1180x940_jfs/t1/85809/25/13704/100868/5e5c6308E3d591a94/bd7760172e73b017.jpg.webp',
    'https://img12.360buyimg.com/pop/s1180x940_jfs/t1/86298/33/13477/99746/5e58d079E969ea839/170941f7e8e822a1.jpg.webp',
    'https://img13.360buyimg.com/pop/s1180x940_jfs/t1/107240/5/1647/103551/5e002016E0e36ba22/236fc2f3e8f68e33.jpg.webp',
    'https://imgcps.jd.com/ling/100005171461/56yU6K6w5pys57K-6YCJ5aSn54mM/5aW956S85LiN5pat/p-5bd8253082acdd181d02fa68/f1a476e4/590x470.jpg',
    'https://img11.360buyimg.com/pop/s1180x940_jfs/t1/94077/40/13431/91413/5e57629eE39ab060a/4adceb3e5e3863fe.jpg.webp',
    'https://img14.360buyimg.com/babel/s1180x940_jfs/t1/95536/21/13800/74692/5e5dd0e1E4437cd3a/3471b54be70e5189.jpg.webp',
    'https://img10.360buyimg.com/babel/s1180x940_jfs/t1/90966/12/13849/94449/5e5dd103E999afa6f/263c188c47d49894.jpg.webp'
];
let swiper2Data = [
    [{
        href: '',
        imgSrc: 'https://img30.360buyimg.com/babel/s380x300_jfs/t1/103866/32/18037/75318/5e90577bE80888f9a/5b31366044616a44.jpg.webp',
        alt: ''
    }, {
        href: '',
        imgSrc: 'https://img12.360buyimg.com/babel/s380x300_jfs/t1/116192/1/2540/103245/5ea27da1E6438d3e0/0885f9a715f07909.png.webp',
        alt: ''
    }, {
        href: '',
        imgSrc: 'https://img30.360buyimg.com/babel/s380x300_jfs/t1/108274/17/14255/56165/5ea56a0eEc9a2f91d/2bd6a9838d056440.jpg.webp',
        alt: ''
    }],
    [{
        href: '',
        imgSrc: 'https://img13.360buyimg.com/babel/s380x300_jfs/t1/110942/16/3095/70029/5ea64ecfE3a820678/e99aa33d9ed1b3d5.jpg.webp',
        alt: ''
    }, {
        href: '',
        imgSrc: 'https://img12.360buyimg.com/babel/s380x300_jfs/t1/113045/23/3085/90081/5ea65198Ee1f45d84/8ac3ebc8ba340272.jpg.webp',
        alt: ''
    }, {
        href: '',
        imgSrc: 'https://img11.360buyimg.com/da/s380x300_jfs/t1/63674/26/5021/72669/5d32ad4eE2e250570/321f2fb7c343e0dc.png.webp',
        alt: ''
    }],
    [{
        href: '',
        imgSrc: 'https://img11.360buyimg.com/pop/s380x300_jfs/t1/112670/25/1263/23615/5e96ac19E2542587f/11d1a625f3aa4958.jpg.webp',
        alt: ''
    }, {
        href: '',
        imgSrc: 'https://img13.360buyimg.com/babel/s380x300_jfs/t1/98214/15/18594/84864/5e9442faE030816a6/23454241f9a53f27.jpg.webp',
        alt: ''
    }, {
        href: '',
        imgSrc: 'https://img11.360buyimg.com/babel/s380x300_jfs/t1/97568/3/19257/80529/5e9d2000Ee10ea634/9cea389671be9711.jpg!q95.webp',
        alt: ''
    }]];
let swiper3Data = [
    [{
        href: '',
        imgSrc: "https://img12.360buyimg.com/mobilecms/s280x280_jfs/t1/115005/38/2116/91587/5e9ec230E6532f496/34d351f9d5376a74.jpg.webp",
        alt: '精选纯棉好货女装短袖T恤女韩版宽松新款夏季女装半袖上衣 黄色133 L(建议96-110斤)',
        newPrice: '29.90',
        oldPrice: '89.00'
    }, {
        href: '',
        imgSrc: "https://img12.360buyimg.com/mobilecms/s280x280_jfs/t1/117506/12/2583/189705/5ea28a36E75be1de3/30043a063ccc7d72.jpg.webp",
        alt: '富安娜出品 馨而乐 夏被 夏凉被子 可水洗夏天薄被子 双人印花夏季空调被芯 甜蜜 1.8米/2米床 230*229cm',
        newPrice: '99.00',
        oldPrice: '159.00'
    },
    {
        href: '',
        imgSrc: "https://img20.360buyimg.com/mobilecms/s280x280_jfs/t1/99943/13/19419/198652/5e9eb5acEb62d886a/ab7590a804d59ce5.png.webp",
        alt: '天梭（TISSOT）手表力洛克系列机械表 男士腕表时尚情侣表 39白盘钢带T006.407.11.033.00',
        newPrice: '2980.00',
        oldPrice: '4600.00'
    },
    {
        href: '',
        imgSrc: "https://img13.360buyimg.com/mobilecms/s280x280_jfs/t1/105504/36/19110/200172/5e9bd1a1E9ec2b258/e675cbb66166ecfb.jpg.webp",
        alt: '琦天QITIAN 天然玛瑙手链男女款附证书 本命年水晶玛瑙珠手串情侣手链三种尺寸可选 红玛瑙手链【8MM】',
        newPrice: '39.90',
        oldPrice: '129.00'
    },
    {
        href: '',
        imgSrc: "https://img20.360buyimg.com/mobilecms/s280x280_jfs/t1/93120/2/19299/99770/5e9e5fd6E1102e75a/b7927a6df65016e2.jpg.webp",
        alt: '稻草人 MEXICAN 商务休闲皮鞋男士正装英伦百搭耐磨驾车轻质 DCR113 黑色 42',
        newPrice: '149.00',
        oldPrice: '179.00'
    }
    ],
];
let swiper4Data = [{
    imgSrc: 'https://img11.360buyimg.com/mobilecms/s260x260_jfs/t19123/36/1794104168/212213/d251d45/5ad95242N7a662496.png.webp',
    alt: '',
    title1: '珠宝饰品美好生活',
    title2: '精选每满300减30',
    bottomBtn: '品类秒杀'
}, {
    imgSrc: 'https://img20.360buyimg.com/mobilecms/s260x260_jfs/t1/51738/32/2409/254610/5d0352e5Ed9b1397e/3f628b499463ac46.jpg.webp',
    alt: '',
    title1: '360车品秒杀',
    title2: '行车记录仪低至199元',
    bottomBtn: '大牌闪购'
}];
